# Pandas
 * filtering
 * sorting
 * useful methods
 * group by
 * merge

In [1]:
import pandas as pd
from datetime import date
from typing import types

In [5]:
import pandas as pd
from datetime import datetime
from typing import List
import pandera as pa
from pandera.typing import DataFrame, Series

# Define the data structure with static type annotations
class Student:
    def __init__(self, roll_no: int, name: str, fathername: str, date_of_admission: datetime, fee: int, course: str):
        self.roll_no = roll_no
        self.name = name
        self.fathername = fathername
        self.date_of_admission = date_of_admission
        self.fee = fee
        self.course = course

# Create a list of students
students: List[Student] = [
    Student(1, "Alice", "John", datetime(2022, 1, 10), 1500, "Mathematics"),
    Student(2, "Bob", "Robert", datetime(2022, 2, 14), 2000, "Physics"),
    Student(3, "Charlie", "Michael", datetime(2022, 3, 18), 1500, "Chemistry"),
    Student(4, "David", "William", datetime(2022, 4, 22), 2500, "Mathematics"),
    Student(5, "Eva", "Richard", datetime(2022, 5, 26), 2000, "Computer Science"),
    Student(6, "Frank", "Joseph", datetime(2022, 6, 30), 1500, "Mathematics"),
    Student(7, "Grace", "Charles", datetime(2022, 7, 4), 2500, "Physics"),
    Student(8, "Hannah", "Thomas", datetime(2022, 8, 8), 2000, "Mathematics"),
    Student(9, "Ivan", "Christopher", datetime(2022, 9, 12), 1500, "Biology"),
    Student(10, "Jack", "Daniel", datetime(2022, 10, 16), 2500, "Computer Science")
]

# Convert the list of students to a DataFrame
student_df = pd.DataFrame([{
    "roll_no": student.roll_no,
    "name": student.name,
    "fathername": student.fathername,
    "course": student.course,
    "date_of_admission": student.date_of_admission,
    "fee": student.fee,
} for student in students])

# Define the schema using pandera

class StudentSchema(pa.SchemaModel):
    roll_no: Series[int] = pa.Field(ge=1)
    name: Series[str] = pa.Field()
    fathername: Series[str] = pa.Field()
    course: Series[str] = pa.Field()
    date_of_admission: Series[datetime] = pa.Field()
    fee: Series[int] = pa.Field(ge=0)

    class Config:
        coerce = True

# Validate the DataFrame
validated_student_df: DataFrame[StudentSchema] = StudentSchema.validate(student_df)

# Display the validated DataFrame
print(validated_student_df)

   roll_no     name   fathername            course date_of_admission   fee
0        1    Alice         John       Mathematics        2022-01-10  1500
1        2      Bob       Robert           Physics        2022-02-14  2000
2        3  Charlie      Michael         Chemistry        2022-03-18  1500
3        4    David      William       Mathematics        2022-04-22  2500
4        5      Eva      Richard  Computer Science        2022-05-26  2000
5        6    Frank       Joseph       Mathematics        2022-06-30  1500
6        7    Grace      Charles           Physics        2022-07-04  2500
7        8   Hannah       Thomas       Mathematics        2022-08-08  2000
8        9     Ivan  Christopher           Biology        2022-09-12  1500
9       10     Jack       Daniel  Computer Science        2022-10-16  2500

# apply filter function on Dataframe

In [6]:
student_df.head(1)

   roll_no   name fathername       course date_of_admission   fee
0        1  Alice       John  Mathematics        2022-01-10  1500

In [7]:
student_df.course.value_counts()

course
Mathematics         4
Physics             2
Computer Science    2
Chemistry           1
Biology             1
Name: count, dtype: int64

In [8]:
student_df.course.value_counts(dropna=False)

course
Mathematics         4
Physics             2
Computer Science    2
Chemistry           1
Biology             1
Name: count, dtype: int64

In [9]:
student_df.course.value_counts(dropna=False, normalize=True)

course
Mathematics         0.4
Physics             0.2
Computer Science    0.2
Chemistry           0.1
Biology             0.1
Name: proportion, dtype: float64

In [10]:
student_df.course.value_counts(dropna=False, normalize=True)*100 # for percentage values

course
Mathematics         40.0
Physics             20.0
Computer Science    20.0
Chemistry           10.0
Biology             10.0
Name: proportion, dtype: float64

In [11]:
student_df

   roll_no     name   fathername            course date_of_admission   fee
0        1    Alice         John       Mathematics        2022-01-10  1500
1        2      Bob       Robert           Physics        2022-02-14  2000
2        3  Charlie      Michael         Chemistry        2022-03-18  1500
3        4    David      William       Mathematics        2022-04-22  2500
4        5      Eva      Richard  Computer Science        2022-05-26  2000
5        6    Frank       Joseph       Mathematics        2022-06-30  1500
6        7    Grace      Charles           Physics        2022-07-04  2500
7        8   Hannah       Thomas       Mathematics        2022-08-08  2000
8        9     Ivan  Christopher           Biology        2022-09-12  1500
9       10     Jack       Daniel  Computer Science        2022-10-16  2500

In [12]:
import pandas as pd
import numpy as np
from datetime import datetime, timedelta
import pandera as pa
from pandera.typing import DataFrame, Series
import random

# Define the schema using pandera
class FeeTransactionSchema(pa.SchemaModel):
    date: Series[datetime] = pa.Field()
    fee: Series[int] = pa.Field(ge=0)

    class Config:
        coerce = True

# Generate random dates within the year 2023
def random_date(start: datetime, end: datetime) -> datetime:
    return start + timedelta(days=random.randint(0, (end - start).days))

# Define the start and end dates for the year 2024
current_year = datetime.now().year
start_date = datetime(current_year, 1, 1)
end_date = datetime.now()

# Generate random fee transactions data
num_transactions = 1000
random.seed(42)  # For reproducibility
fee_transactions = [
    {"date": random_date(start_date, end_date), "fee": random.randint(1000, 3000)}
    for _ in range(num_transactions)
]

# Convert the list of fee transactions to a DataFrame
fee_transactions_df = pd.DataFrame(fee_transactions)

# Validate the DataFrame
validated_fee_transactions_df: DataFrame[FeeTransactionSchema] = FeeTransactionSchema.validate(fee_transactions_df)

# Display the validated DataFrame
print(validated_fee_transactions_df)

          date   fee
0   2024-06-12  1228
1   2024-01-07  2518
2   2024-03-11  1501
3   2024-02-27  1285
4   2024-07-07  1209
..         ...   ...
995 2024-06-04  2902
996 2024-06-17  2698
997 2024-06-26  1547
998 2024-01-08  1369
999 2024-03-10  2439

[1000 rows x 2 columns]

In [13]:
pd.cut(fee_transactions_df.fee,
       [1,500,1000,2000,3000,4000,5000])

0      (1000, 2000]
1      (2000, 3000]
2      (1000, 2000]
3      (1000, 2000]
4      (1000, 2000]
           ...
995    (2000, 3000]
996    (2000, 3000]
997    (1000, 2000]
998    (1000, 2000]
999    (2000, 3000]
Name: fee, Length: 1000, dtype: category
Categories (6, interval[int64, right]): [(1, 500] < (500, 1000] < (1000, 2000] < (2000, 3000] < (3000, 4000] < (4000, 5000]]

In [14]:
pd.cut(fee_transactions_df.fee,
       [1,500,1000,2000,3000,4000,5000]).value_counts()

fee
(1000, 2000]    515
(2000, 3000]    485
(1, 500]          0
(500, 1000]       0
(3000, 4000]      0
(4000, 5000]      0
Name: count, dtype: int64

In [15]:
pd.cut(fee_transactions_df.fee,
       [1,500,1000,2000,3000,4000,5000]).value_counts(normalize=True)*100

fee
(1000, 2000]    51.5
(2000, 3000]    48.5
(1, 500]         0.0
(500, 1000]      0.0
(3000, 4000]     0.0
(4000, 5000]     0.0
Name: proportion, dtype: float64

In [16]:
pd.qcut(fee_transactions_df.fee, [0.3, 0.5, 0.9,1])

0                   NaN
1      (1969.0, 2794.0]
2                   NaN
3                   NaN
4                   NaN
             ...
995    (2794.0, 2999.0]
996    (1969.0, 2794.0]
997                 NaN
998                 NaN
999    (1969.0, 2794.0]
Name: fee, Length: 1000, dtype: category
Categories (3, interval[float64, right]): [(1600.699, 1969.0] < (1969.0, 2794.0] < (2794.0, 2999.0]]

In [17]:
pd.qcut(fee_transactions_df.fee, [0, 0.3, 0.5, 0.9, 1]).value_counts()

fee
(1969.0, 2794.0]      400
(1003.999, 1600.7]    300
(1600.7, 1969.0]      201
(2794.0, 2999.0]       99
Name: count, dtype: int64

In [18]:
pd.qcut(fee_transactions_df.fee, [0, 0.3, 0.5, 0.9, 1]).value_counts(normalize=True)*100

fee
(1969.0, 2794.0]      40.0
(1003.999, 1600.7]    30.0
(1600.7, 1969.0]      20.1
(2794.0, 2999.0]       9.9
Name: proportion, dtype: float64

In [19]:
student_df.head()

   roll_no     name fathername            course date_of_admission   fee
0        1    Alice       John       Mathematics        2022-01-10  1500
1        2      Bob     Robert           Physics        2022-02-14  2000
2        3  Charlie    Michael         Chemistry        2022-03-18  1500
3        4    David    William       Mathematics        2022-04-22  2500
4        5      Eva    Richard  Computer Science        2022-05-26  2000

# Filter on columns
 * &, |, ~ 
 Syntax:
'''
DataFrame[(dataframe.column1 == 'value') & (datframe.column2 == 'value2)]
'''
 * string column
 * numeric column
 * datetime column

In [20]:
student_df['course'] == 'Physics'

0    False
1     True
2    False
3    False
4    False
5    False
6     True
7    False
8    False
9    False
Name: course, dtype: bool

In [21]:
student_df.head()

   roll_no     name fathername            course date_of_admission   fee
0        1    Alice       John       Mathematics        2022-01-10  1500
1        2      Bob     Robert           Physics        2022-02-14  2000
2        3  Charlie    Michael         Chemistry        2022-03-18  1500
3        4    David    William       Mathematics        2022-04-22  2500
4        5      Eva    Richard  Computer Science        2022-05-26  2000

In [22]:
student_df['course'].str.lower()

0         mathematics
1             physics
2           chemistry
3         mathematics
4    computer science
5         mathematics
6             physics
7         mathematics
8             biology
9    computer science
Name: course, dtype: object

In [23]:
student_df['course'].str.lower() == 'physics'

0    False
1     True
2    False
3    False
4    False
5    False
6     True
7    False
8    False
9    False
Name: course, dtype: bool

In [24]:
student_df[student_df['course'].str.lower() == 'physics']

   roll_no   name fathername   course date_of_admission   fee
1        2    Bob     Robert  Physics        2022-02-14  2000
6        7  Grace    Charles  Physics        2022-07-04  2500

In [25]:
student_df['course'].str.lower() .str.contains('cs')

0     True
1     True
2    False
3     True
4    False
5     True
6     True
7     True
8    False
9    False
Name: course, dtype: bool

In [26]:
student_df[student_df['course'].str.lower() .str.contains('cs')]

   roll_no    name fathername       course date_of_admission   fee
0        1   Alice       John  Mathematics        2022-01-10  1500
1        2     Bob     Robert      Physics        2022-02-14  2000
3        4   David    William  Mathematics        2022-04-22  2500
5        6   Frank     Joseph  Mathematics        2022-06-30  1500
6        7   Grace    Charles      Physics        2022-07-04  2500
7        8  Hannah     Thomas  Mathematics        2022-08-08  2000

In [27]:
student_df[student_df['course'].str.lower() .str.contains('sc')]

   roll_no  name fathername            course date_of_admission   fee
4        5   Eva    Richard  Computer Science        2022-05-26  2000
9       10  Jack     Daniel  Computer Science        2022-10-16  2500

In [28]:
student_df[student_df['course'].str.lower() .str.contains('cs') & (student_df['fee']>=2000)]

   roll_no    name fathername       course date_of_admission   fee
1        2     Bob     Robert      Physics        2022-02-14  2000
3        4   David    William  Mathematics        2022-04-22  2500
6        7   Grace    Charles      Physics        2022-07-04  2500
7        8  Hannah     Thomas  Mathematics        2022-08-08  2000

In [29]:
student_df['course'].str.lower() .str.contains('cs')
student_df['course'].str.lower() .str.contains('sc')

0    False
1    False
2    False
3    False
4     True
5    False
6    False
7    False
8    False
9     True
Name: course, dtype: bool

In [30]:
student_df['course'].str.lower() .str.contains('cs') & student_df['course'].str.lower() .str.contains('ma')

0     True
1    False
2    False
3     True
4    False
5     True
6    False
7     True
8    False
9    False
Name: course, dtype: bool

In [31]:
student_df['course'].str.lower() .str.contains('cs') & student_df['course'].str.lower() .str.contains('sc')

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: course, dtype: bool

In [32]:
student_df['course'].str.lower() .str.contains('cs') | student_df['course'].str.lower() .str.contains('sc')

0     True
1     True
2    False
3     True
4     True
5     True
6     True
7     True
8    False
9     True
Name: course, dtype: bool

In [33]:
student_df[student_df['course'].str.lower().str.contains('cs') | student_df['course'].str.lower() .str.contains('sc')]

   roll_no    name fathername            course date_of_admission   fee
0        1   Alice       John       Mathematics        2022-01-10  1500
1        2     Bob     Robert           Physics        2022-02-14  2000
3        4   David    William       Mathematics        2022-04-22  2500
4        5     Eva    Richard  Computer Science        2022-05-26  2000
5        6   Frank     Joseph       Mathematics        2022-06-30  1500
6        7   Grace    Charles           Physics        2022-07-04  2500
7        8  Hannah     Thomas       Mathematics        2022-08-08  2000
9       10    Jack     Daniel  Computer Science        2022-10-16  2500